## Introduction to pandas Data Structures
### Series

In [1]:
from pandas import Series, DataFrame

import pandas as pd

import numpy as np

A Series is a **one-dimensional array-like object** containing an array of data (of any NumPy data type) and an **associated array of data labels**, called its *index*.

**Create Series from Python list**

In [2]:
obj = Series([4, 7, -5, 3]) 

obj

0    4
1    7
2   -5
3    3
dtype: int64

Get content and index of a Series via **values** and **index** attributes:

In [3]:
obj.values

array([ 4,  7, -5,  3])

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c']) # Specify an index 

obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2.index

Index([u'd', u'b', u'a', u'c'], dtype='object')

**Use index when selecting single values or a set of values**:

In [7]:
obj2['a']

-5

In [8]:
obj2['d'] = 6 # Assignment

In [9]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

**NumPy array operations will preserve the index-value link**:

In [10]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [11]:
obj2[obj2 > 0] # Filtering with a boolean array

d    6
b    7
c    3
dtype: int64

In [12]:
obj2 * 2 # Vectorized scalar multiplication

d    12
b    14
a   -10
c     6
dtype: int64

In [13]:
np.exp(obj2) # Applying math functions

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

Another way to think about Series is as a **fixed-length, ordered dict**, as it is a mapping of index values to data values. It can be substituted into many functions that expect a dict:

In [14]:
'b' in obj2

True

In [15]:
'e' in obj2

False

**Create Series from Python dict**:

**When only passing a dict, the index in the resulting Series will have the dict's keys in sorted order**:

In [16]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

obj3 = Series(sdata)

obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

**Specify an index when creating a Series object**

In [17]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

obj4 = Series(sdata, index=states)

obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

Detect missing data using **isnull** or **notnull**:

In [18]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [19]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [20]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

**Auto-align differently-index data in arithmetic operations**:

In [21]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [22]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [23]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

**Both the Series object itself and its index have a name attribute**:

In [24]:
obj4.name = 'population'

obj4.index.name = 'state'

obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

**Altering a Series' index in place by assignment**:

In [25]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

A DataFrame represents a tabular, spreadsheet-like data structure containing an ordered collection of columns, each of which can be a different value type (numeric, string, boolean, etc.). The DataFrame has both a row and column index; it can be thought of as a dict of Series (one for all sharing the same index).

**Create DataFrame from a dict of equal-length lists or NumPy arrays**:

In [26]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

frame = DataFrame(data)

frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

**Specify a sequence of columns**:

In [27]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

**If passed a column that isn't contained in data, it will appear with NA values**:

In [28]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])

frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [29]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [30]:
frame2.index

Index([u'one', u'two', u'three', u'four', u'five'], dtype='object')

**Retrieve column in DataFrame by dict-like notation or by attribute. The returned Series have the same index as the DataFrame**:

In [31]:
frame2['state'] # Series

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [32]:
frame2.year # Series

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

**Rows can be retrieved by position or label**:

1. **.ix**: range or point selection (row or column), on label, integer, or boolean index
2. **.loc**: range or point selection (row or column), on label or boolean index
3. **.iloc**: range or point selection (row or column), on integer or boolean index
4. **.iat**: point selection (row and column), on integer index
5. **.at**: point selection(row and column), on label index

In [33]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

**Example: .ix**

In [34]:
frame2.ix['three', 'year'] #[point, point]

2002

In [35]:
frame2.ix['three'] #[point, all]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [36]:
frame2.ix['three', 'year':'pop'] #[point, range]

year     2002
state    Ohio
pop       3.6
Name: three, dtype: object

In [37]:
frame2.ix[:, 'year'] #[all, point]

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [38]:
frame2.ix[:, :] #[all, all]

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [39]:
frame2.ix[:, 'year':'pop'] #[all, range]

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9

In [40]:
frame2.ix['three':'five'] #[range, all]

       year   state  pop debt
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [41]:
frame2.ix['three':'five', 'year'] #[range, point]

three    2002
four     2001
five     2002
Name: year, dtype: int64

In [42]:
frame2.ix['three':'five', 'year':'pop'] #[range, range]

       year   state  pop
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9

**Example: .iat**

In [43]:
frame2.iat[2, 0]

2002

**Example: .at**

In [44]:
frame2.at['two', 'year']

2001

**Vectorized/broadcast column assignment**

In [45]:
frame2['debt'] = 16.5

frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [46]:
frame2['debt'] = np.arange(5.)

frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

When assigning lists or arrays to a column, the value's length must match the length of the DataFrame. 

But when assigning a Series obj as a column to DataFrame, it will be **aligned by index** (inserting missing values in any holes):

In [47]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

frame2['debt'] = val

frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

**Assigning a column that doesn't exist will create a new column**:

In [48]:
frame2.state == 'Ohio' # Boolean Series obj

one       True
two       True
three     True
four     False
five     False
Name: state, dtype: bool

In [49]:
frame2['eastern'] = frame2.state == 'Ohio'

frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

**Use del to delete a column as in a dict**:

In [50]:
del frame2['eastern']

In [51]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

**Create DataFrame from nested dict:**

In [52]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

frame3 = DataFrame(pop)

frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

**The keys in the inner dicts are unioned and sorted to form the index in the result, nnless an explicit index is specified**:

In [53]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

**Create DataFrame from dict of Series**:

In [54]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}

In [55]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

Set a DataFrame's name attribute of **index** and **columns**

In [56]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

The **values** attribute returns the data contained in the DataFrame as a 2D ndarray:

In [57]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [58]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

### Index Objects

pandas's Index objects are responsible for holding the axis labels and other metadata (like the axis name or names).

In [59]:
obj = Series(range(3), index=['a', 'b', 'c'])

In [60]:
index = obj.index

index

Index([u'a', u'b', u'c'], dtype='object')

In [61]:
index[1:]

Index([u'b', u'c'], dtype='object')

**Index objects are immutable and thus can't be modified by the user**

In [62]:
# index[1] = 'd' Wrong!

In [63]:
index = pd.Index(np.arange(3))

obj2 = Series([1.5, -2.5, 0], index=index)

In [64]:
obj2.index is index

True

**Index as fixed-size set**:

In [65]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [66]:
'Ohio' in frame3.columns

True

In [67]:
2003 in frame3.index

False

## Essential Functionality
### Reindexing

Create a new object (Series or DataFrame) with the data **conformed** to a new index:

In [68]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [69]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e']) 
# Rearrange the data according to the new index, introducing missing values if needed

obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [70]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0) # fill missing values with 0's

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [71]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [72]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [73]:
obj3.reindex(range(6), method='ffill') # Forward-fill missing values
# ffill or pad for forward filling
# bfill or backfill for backward filling

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

**For DataFrame, reindex can alter either index(index) or column(index). When passed just a sequence, the rows are reindexed in the result**:

In [74]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])

frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [75]:
frame2 = frame.reindex(list('abcd'))

frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

**The columns can be reindexed using the columns keyword**:

In [76]:
states = ['Texas', 'Utah', 'California']

In [77]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

**reindex** in both rows and cols in one shot (interpolcation will only apply row-wise):

In [78]:
frame.reindex(index=list('abcd'), method='ffill', columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

reindexing can be done more succinctly by label-indexing with **ix**:

In [79]:
frame.ix[list('abcd'), states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

### Dropping entries from an axis

**drop** method will return a new object with the indicated value or values deleted from an axis:

In [80]:
obj = Series(np.arange(5.), index=list('abcde'))

obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [81]:
new_obj = obj.drop('c')

new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [82]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

**With DataFrame, index values can be deleted from either axis**:

In [83]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [84]:
data.drop(['Colorado', 'Ohio']) # Drop rows

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [85]:
data.drop('two', axis=1) # Drop cols

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

### Indexing, selection, and filtering

Use **1)integer, 2)label, or 3)boolean array** for indexing

**Series**

In [86]:
obj = Series(np.arange(4.), index=list('abcd'))

obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [87]:
obj['b']

1.0

In [88]:
obj[1]

1.0

In [89]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [90]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [91]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [92]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [93]:
obj['b':'c'] # Slicing with LABELS: endpoint is inclusive

b    1.0
c    2.0
dtype: float64

In [94]:
obj['b':'c'] = 5 # Vectorized/broadcast assignment

obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

**DataFrame**

In [95]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

**Selecting single column**:

In [96]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

**Selecting multiple columns**:

In [97]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

**Special cases**: selecing **ROWS** using slicing or boolean array

In [98]:
data[:2] # slicing

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [99]:
data[data['three'] > 5] # boolean array

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

**Indexing using boolean DataFrame**:

In [100]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [101]:
data[data < 5] = 0

**.ix**: most expressive indexer

In [102]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [103]:
data.ix['Colorado', ['two', 'three']] # Series

two      5
three    6
Name: Colorado, dtype: int64

In [104]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]] # DataFrame

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [105]:
data.ix[2] # Series: row

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [106]:
data.ix[:'Utah', 'two'] # Series

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [107]:
data.ix[data.three > 5, :3] # DataFrame

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Arithmetic and data alignment

When adding together objects, if any index pairs are not the same, the respective index in the result will be the **union** of the index pairs.

In [108]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=list('acde'))

s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [109]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=list('acefg'))

s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [110]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

**In the case of DataFrame, alignment is performed on both the rows and the columns**:

In [111]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])

df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [112]:
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])

df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [113]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### Arithmetic methods with fill values

In [114]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))

df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [115]:
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [116]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [117]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

When reindexing a Series or DataFrame, you can also specify a different fill value:

In [118]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series 

**Vectorized/broadcast arithmetic between 2d and 1d arrays**:

In [119]:
arr = np.arange(12.).reshape((3, 4))

arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [120]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [121]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

**Vectorized/broadcast arithmetic between DataFrame and Series obj**:

In [122]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [123]:
series = frame.ix[0]

series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [124]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

**If an index value is not found in either the DataFrame's columns or the Series's index, the objects will be reindexed to form the union**:

In [125]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [126]:
series2 = Series(range(3), index=list('bef'))

series2

b    0
e    1
f    2
dtype: int64

In [127]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

**Subtract a column Series**:

In [128]:
series3 = frame['d']

series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [129]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [130]:
frame.sub(series3, axis=0) # axis=0 (row) is the axis to match both indices on

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function application and mapping

In [131]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

frame

               b         d         e
Utah   -0.153986  0.261858  0.156072
Ohio   -0.148242 -0.578167  0.440407
Texas  -1.476139  0.886385 -0.744510
Oregon -0.229730  0.958145 -1.688420

In [132]:
np.abs(frame)

               b         d         e
Utah    0.153986  0.261858  0.156072
Ohio    0.148242  0.578167  0.440407
Texas   1.476139  0.886385  0.744510
Oregon  0.229730  0.958145  1.688420

**Applying a function on 1D arrays to each column or row**:

In [133]:
f = lambda x: x.max() - x.min() # list -> scalar

In [134]:
frame.apply(f) # Default: compute over rows, broadcast over cols

b    1.327896
d    1.536312
e    2.128826
dtype: float64

In [135]:
frame.apply(f, axis=1)

Utah      0.415844
Ohio      1.018573
Texas     2.362524
Oregon    2.646564
dtype: float64

The function passed to **apply** need not return a scalar value, it can also return a Series with multiple values:

In [136]:
def f(x): # list -> list
    return Series([x.min(), x.max()], index=['min', 'max'])

frame.apply(f)

            b         d         e
min -1.476139 -0.578167 -1.688420
max -0.148242  0.958145  0.440407

**Element-wise function on DataFrame: scalar -> scalar**:

In [137]:
frame

               b         d         e
Utah   -0.153986  0.261858  0.156072
Ohio   -0.148242 -0.578167  0.440407
Texas  -1.476139  0.886385 -0.744510
Oregon -0.229730  0.958145 -1.688420

In [138]:
format = lambda x: '%.2f' % x # scalar -> scalar

In [139]:
frame.applymap(format) # Apply on each element in a DataFrame: scalar -> scalar

            b      d      e
Utah    -0.15   0.26   0.16
Ohio    -0.15  -0.58   0.44
Texas   -1.48   0.89  -0.74
Oregon  -0.23   0.96  -1.69

**Series has a map method for applying an element-wise function**:

In [140]:
frame['e'].map(format)

Utah       0.16
Ohio       0.44
Texas     -0.74
Oregon    -1.69
Name: e, dtype: object

### Sorting and ranking

To sort lexicographically by row or column index, use the **sort_index** method, which returns a new, sorted object:

In [141]:
obj = Series(range(4), index=list('dabc'))

obj

d    0
a    1
b    2
c    3
dtype: int64

In [142]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

**With a DataFrame, you can sort by index on either axis(row or col)**:

In [143]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=list('dabc'))

frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [144]:
frame.sort_index() # Sort by the label values in index(row):

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [145]:
frame.sort_index(axis=1) # Sort by the label values in columns(col):

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [146]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

To sort a Series by its values, use its **sort_values** method:

In [147]:
obj = Series([4, 7, -3, 2])

obj

0    4
1    7
2   -3
3    2
dtype: int64

In [148]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [149]:
obj = Series([4, np.nan, 7, np.nan, -3, 2]) # missing values are sorted to the end of the Series by default

obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

On DataFrame, you may want to sort by the values in one or more columns. To do so, pass one or more column names to the **by** option:

In [150]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [151]:
frame.sort_values(by="b")

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

**To sort by multiple columns, pass a list of names**:

In [152]:
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

**Ranking** is closely related to sorting, assigning ranks from one through the number of valid data points in an array. It is similar to the indirect sort indices produced by numpy.argsort , except that ties are broken according to a rule. The rank methods for Series and DataFrame are the place to look; by default rank breaks ties by assigning each group the mean rank:

In [153]:
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [154]:
obj.rank() # 'average'(Default): Assign the average rank to each entry in the equal group

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [155]:
obj.rank(method='first') # 'first' Assign ranks in the order the values appear in the data

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [156]:
obj.rank(method='max') # 'max': Use the maximum rank for the whole group.

0    7.0
1    1.0
2    7.0
3    5.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [157]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

**DataFrame can compute ranks over the rows or the columns**:

In [158]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})

frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [159]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

### Axis indexes with duplicate values

While many pandas functions (like reindex ) require that the labels be unique, it's not mandatory.

A small Series with duplicate indices:

In [160]:
obj = Series(range(5), index=list('aabbc'))

obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

The index's **is_unique** property can tell you whether its values are unique or not:

In [161]:
obj.index.is_unique

False

**Data selection is one of the main things that behaves differently with duplicates. Indexing a value with multiple entries returns a Series while single entries return a scalar value**:

In [162]:
obj['a'] # Series

a    0
a    1
dtype: int64

In [163]:
obj['c'] # scalar

4

**The same logic extends to indexing rows in a DataFrame**:

In [164]:
df = DataFrame(np.random.randn(4, 3), index=list('acbb'))

df

          0         1         2
a  0.807684 -1.332307  1.148432
c -1.295715 -1.173776 -0.561328
b  0.044567  1.176075 -0.820066
b -1.112807 -0.753736  0.500062

In [165]:
df.ix['b'] # DataFrame

          0         1         2
b  0.044567  1.176075 -0.820066
b -1.112807 -0.753736  0.500062

In [166]:
df.ix['c'] # Series

0   -1.295715
1   -1.173776
2   -0.561328
Name: c, dtype: float64

## Summarizing and Computing Descriptive Statistics

pandas objects are equipped with a set of common mathematical and statistical methods. Most of these fall into the category of reductions or summary statistics, methods that extract a single value (like the sum or mean) from a Series or a Series of values from the rows or columns of a DataFrame.

In [167]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=list('abcd'),
               columns=['one', 'two'])

df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [168]:
df.sum() # Default: column sums

one    9.25
two   -5.80
dtype: float64

In [169]:
df.sum(axis=1) # row sums

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [170]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

NA values are excluded unless the entire slice (row or column in this case) is NA (i.e. empty list). This can be disabled using the **skipna** option:

In [171]:
df.mean(axis=1, skipna=False) # Compute means only on rows with no NA's

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

Some methods, like **idxmin** and **idxmax**, return indirect statistics like the index value where the minimum or maximum values are attained:

In [172]:
df.idxmax() # Row index of the max value in each column

one    b
two    d
dtype: object

In [173]:
df.idxmin() # Row index of the min value in each column

one    d
two    b
dtype: object

In [174]:
df.cumsum() # Cumulative sum over columns: skipna = True

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [175]:
df.describe() # produce multiple summary statistics in one shot

/home/jichao/.local/lib/python2.7/site-packages/numpy/lib/function_base.py:3834: RuntimeWarning: Invalid value encountered in percentile
  RuntimeWarning)

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%         NaN       NaN
50%         NaN       NaN
75%         NaN       NaN
max    7.100000 -1.300000

On non-numeric data, **describe** produces alternate summary statistics:

In [176]:
obj = Series(list('aabc') * 4)

obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [177]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and Covariance

In [178]:
# Stock prices from Yahoo! Finance

from pandas_datareader import data as web, wb

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2000', '1/1/2010')

price = DataFrame({tic: data['Adj Close']
                    for tic, data in all_data.iteritems()})

volume = DataFrame({tic: data['Volume']
                    for tic, data in all_data.iteritems()})

In [179]:
returns = price.pct_change() # Percent changes of the prices: returns a DataFrame

In [180]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2009-12-24  0.034339  0.011117  0.004385  0.002587
2009-12-28  0.012294  0.007098  0.013326  0.005484
2009-12-29 -0.011861 -0.005571 -0.003477  0.007058
2009-12-30  0.012147  0.005376  0.005461 -0.013699
2009-12-31 -0.004300 -0.004416 -0.012597 -0.015504

The **corr** method of Series computes the correlation of the overlapping, non-NA, aligned-by-index values in two Series.

In [181]:
returns.MSFT.corr(returns.IBM) # Correlation between MSFT (Series) and IBM (Series)

0.49597967972033752

In [182]:
returns.MSFT.cov(returns.IBM)

0.00021595764064430051

DataFrame's **corr** and **cov** methods return a full correlation or covariance matrix as a DataFrame

In [183]:
returns.corr() # DataFrame

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.470676  0.410011  0.424305
GOOG  0.470676  1.000000  0.390689  0.443587
IBM   0.410011  0.390689  1.000000  0.495980
MSFT  0.424305  0.443587  0.495980  1.000000

In [184]:
returns.cov() # DataFrame

          AAPL      GOOG       IBM      MSFT
AAPL  0.001027  0.000303  0.000252  0.000309
GOOG  0.000303  0.000580  0.000142  0.000205
IBM   0.000252  0.000142  0.000367  0.000216
MSFT  0.000309  0.000205  0.000216  0.000516

Using DataFrame's **corrwith** method, you can compute pairwise correlations between a DataFrame's columns or rows with another Series or DataFrame:

In [185]:
returns.corrwith(returns.IBM) # Correlation of columns in returns (DataFrame) with a Series obj(IBM)

AAPL    0.410011
GOOG    0.390689
IBM     1.000000
MSFT    0.495980
dtype: float64

**Passing a DataFrame computes the correlations of matching column names**:

In [186]:
returns.corrwith(volume) # Correlation between corresponding columns (Series obj) in two DataFrames

AAPL   -0.057549
GOOG    0.062647
IBM    -0.007892
MSFT   -0.014245
dtype: float64

### Unique Values, Value Counts, and Membership

In [187]:
obj = Series(list('cadaabbcc'))

obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

**unique** gives you an array of the unique values in a Series:

In [188]:
uniques = obj.unique()

uniques # Not necessarily in sorted order

array(['c', 'a', 'd', 'b'], dtype=object)

In [189]:
uniques.sort()

uniques # Sorted

array(['a', 'b', 'c', 'd'], dtype=object)

**value_counts** returns a counter of the elements in a Series

Just like **Counter** (from collections import Counter)

In [190]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [191]:
pd.value_counts(obj.values, sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [192]:
from collections import Counter

Counter(obj.values)

Counter({'a': 3, 'b': 2, 'c': 3, 'd': 1})

**isin** is responsible for vectorized set membership and can be very useful in filtering a dataset down to a subset of values in a Series or column in a DataFrame:

In [193]:
mask = obj.isin(['b', 'c'])

mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [194]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

**In some cases, you may want to compute a histogram on multiple related columns in a DataFrame**:

In [195]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})

data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [196]:
data.apply(pd.value_counts) # Histogram on values in each column (Series). Then merge the resulting Series

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [197]:
data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## Handling Missing Data

All of the descriptive statistics on pandas objects exclude missing data. pandas uses **np.nan** to represent missing data in both floating as well as non-floating point arrays:

In [198]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])

string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [199]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [200]:
string_data[0] = None

The built-in Python **None** value is also treated as NA in object arrays:

In [201]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [202]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

**dropna** returns the Series with only the non-null data and index values:

In [203]:
from numpy import nan as NA

data = Series([1, NA, 3.5, NA, 7])

data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [204]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [205]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

By default **dropna** drops any row containing a missing value:

In [206]:
cleaned = data.dropna() # dropna(axis=0,how="any")

cleaned

     0    1    2
0  1.0  6.5  3.0

In [207]:
data.dropna(how='all') # Drop rows that are all NA

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [208]:
data[4] = NA # Vectorized/broadcast assignment

data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [209]:
data.dropna(axis=1, how='all') # Drop columns that are all NA

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

**Keep only rows containing a certain number of observations**:

In [210]:
df = DataFrame(np.random.randn(7, 3))

df

          0         1         2
0  0.930074  1.710957  0.682766
1  0.295034 -2.292053 -0.848770
2  1.314821  0.054606  1.764291
3  2.320722  0.271590 -1.187324
4 -0.908471 -0.911687 -0.373534
5  0.334141  0.515363  0.437475
6 -1.166713 -1.601725 -1.197781

In [211]:
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA

df

          0         1         2
0  0.930074       NaN       NaN
1  0.295034       NaN       NaN
2  1.314821       NaN       NaN
3  2.320722       NaN -1.187324
4 -0.908471       NaN -0.373534
5  0.334141  0.515363  0.437475
6 -1.166713 -1.601725 -1.197781

In [212]:
df.dropna(thresh=3) # At least 3 non-NA elements in a row

          0         1         2
5  0.334141  0.515363  0.437475
6 -1.166713 -1.601725 -1.197781

### Filling in Missing Data

Call **fillna** with a constant replaces missing values with that value:

In [213]:
df

          0         1         2
0  0.930074       NaN       NaN
1  0.295034       NaN       NaN
2  1.314821       NaN       NaN
3  2.320722       NaN -1.187324
4 -0.908471       NaN -0.373534
5  0.334141  0.515363  0.437475
6 -1.166713 -1.601725 -1.197781

In [214]:
df.fillna(0)

          0         1         2
0  0.930074  0.000000  0.000000
1  0.295034  0.000000  0.000000
2  1.314821  0.000000  0.000000
3  2.320722  0.000000 -1.187324
4 -0.908471  0.000000 -0.373534
5  0.334141  0.515363  0.437475
6 -1.166713 -1.601725 -1.197781

Call **fillna** with a dict you can use a different fill value for each column:

In [215]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0  0.930074  0.500000       NaN
1  0.295034  0.500000       NaN
2  1.314821  0.500000       NaN
3  2.320722  0.500000 -1.187324
4 -0.908471  0.500000 -0.373534
5  0.334141  0.515363  0.437475
6 -1.166713 -1.601725 -1.197781

**fillna** returns a new object, but you can modify the existing object in place:

In [216]:
df.fillna(0, inplace=True)

df

          0         1         2
0  0.930074  0.000000  0.000000
1  0.295034  0.000000  0.000000
2  1.314821  0.000000  0.000000
3  2.320722  0.000000 -1.187324
4 -0.908471  0.000000 -0.373534
5  0.334141  0.515363  0.437475
6 -1.166713 -1.601725 -1.197781

The same interpolation methods available for reindexing can be used with **fillna**:

In [217]:
df = DataFrame(np.random.randn(6, 3))

In [218]:
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA

df

          0         1         2
0 -1.204570 -1.108777  0.488140
1 -0.593186  0.668492  0.633298
2  0.642307       NaN -0.606552
3 -0.453875       NaN -0.200605
4 -0.939953       NaN       NaN
5 -0.502256       NaN       NaN

In [219]:
df.fillna(method='ffill')

          0         1         2
0 -1.204570 -1.108777  0.488140
1 -0.593186  0.668492  0.633298
2  0.642307  0.668492 -0.606552
3 -0.453875  0.668492 -0.200605
4 -0.939953  0.668492 -0.200605
5 -0.502256  0.668492 -0.200605

In [220]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -1.204570 -1.108777  0.488140
1 -0.593186  0.668492  0.633298
2  0.642307  0.668492 -0.606552
3 -0.453875  0.668492 -0.200605
4 -0.939953       NaN -0.200605
5 -0.502256       NaN -0.200605

**Fill NA with mean or median value of a Series**:

In [221]:
data = Series([1., NA, 3.5, NA, 7])

In [222]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Hierarchical Indexing

Hierachical indexing enables you to have multiple index levels on an axis. It provides a way to work with higher dimensional data in a lower dimensional form.

**MultiIndexed Series**: Create a Series with a list of lists or arrays as the index

In [223]:
data = Series(np.random.randn(10),
              index = [list('aaabbbccdd'),
              [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

data

a  1    0.885873
   2   -0.040322
   3    0.239644
b  1   -1.034728
   2    0.550634
   3   -0.346250
c  1   -1.913575
   2    1.607946
d  2    0.339315
   3   -0.162078
dtype: float64

In [224]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

*Paritial* indexing:

In [225]:
data['b'] # Series

1   -1.034728
2    0.550634
3   -0.346250
dtype: float64

In [226]:
data['b'].index

Int64Index([1, 2, 3], dtype='int64')

In [227]:
data['b':'c'] # Series

b  1   -1.034728
   2    0.550634
   3   -0.346250
c  1   -1.913575
   2    1.607946
dtype: float64

In [228]:
data.ix[['b', 'd']] # Series

b  1   -1.034728
   2    0.550634
   3   -0.346250
d  2    0.339315
   3   -0.162078
dtype: float64

In [229]:
data['b', 1] # Full index: scalar

-1.0347277975672791

Selection from an **inner level** index:

In [230]:
data[:, 2] # Wildcard on level=0, 2 on level=1

a   -0.040322
b    0.550634
c    1.607946
d    0.339315
dtype: float64

**unstack**: Pivot a level of the (necessarily hierarchical) index labels, returning a DataFrame having a new level of column labels whose inner-most level consists of the pivoted index labels.

In [231]:
data.unstack() # DataFrame: the innermost level (1, 2, 3) in MultiIndex is moved to the column

          1         2         3
a  0.885873 -0.040322  0.239644
b -1.034728  0.550634 -0.346250
c -1.913575  1.607946       NaN
d       NaN  0.339315 -0.162078

In [232]:
data.unstack().stack()

a  1    0.885873
   2   -0.040322
   3    0.239644
b  1   -1.034728
   2    0.550634
   3   -0.346250
c  1   -1.913575
   2    1.607946
d  2    0.339315
   3   -0.162078
dtype: float64

**With a DataFrame, either axis can have a hierarchical index**:

In [233]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[list('aabb'), [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])

frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

**Assign names to hierachical levels**:

In [234]:
frame.index.names = ['key1', 'key2']

frame.columns.names = ['state', 'color']

frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [235]:
frame['Ohio'].index

MultiIndex(levels=[[u'a', u'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]],
           names=[u'key1', u'key2'])

In [236]:
frame['Ohio'].columns

Index([u'Green', u'Red'], dtype='object', name=u'color')

In [237]:
frame['Ohio'] # DataFrame

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

**Create MultiIndex from arrays**:

In [238]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], 
                           ['Green', 'Red', 'Green']],
                          names=['state', 'color'])

MultiIndex(levels=[[u'Colorado', u'Ohio'], [u'Green', u'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=[u'state', u'color'])

### Reordering and Sorting Levels

The **swaplevel** takes two level numbers or names and returns a new object with the levels interchanged (but the data is otherwise unaltered):

In [239]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [240]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

**sortlevel** sorts the data (stably) using only the values in a single level.

In [241]:
frame.sortlevel(1) # level 1 ("key2"): 1, 1, 2, 2

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [242]:
frame.swaplevel(0, 1)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

When swapping levels, it's not uncommon to also use sortlevel so that the result is lexicographically sorted:

In [243]:
frame.swaplevel(0, 1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary Statistics by Level

Perform descriptive and summary statistics on DataFrame and Series on a specific **level**:

In [244]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [245]:
frame.sum(level='key2') # on row index

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [246]:
frame.sum(level='color', axis=1) # on col index

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Using a DataFrame's Columns

It's not unusual to want to use one or more columns from a DataFrame as the row index; alternatively, you may wish to move the row index into the DataFrame's columns.

In [247]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})            

frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

DataFrame's **set_index** function will create a new DataFrame using one or more of its columns as the index:

In [248]:
frame2 = frame.set_index(['c', 'd'])

frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [249]:
frame2.index

MultiIndex(levels=[[u'one', u'two'], [0, 1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 1], [0, 1, 2, 0, 1, 2, 3]],
           names=[u'c', u'd'])

By default the columns are removed from the DataFrame, though you can leave them in:

In [250]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [251]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [252]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

**reset_index** does the opposite of **set_index**: the hierachical index levels are moved into the columns:

In [253]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## Other pandas Topics

### Integer Indexing

In [254]:
ser = Series(np.arange(3.)) # Only integer indexing possible

ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [255]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c']) # Both integer and label indexing

ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [256]:
ser2[-1] # integer indexing

2.0

In [257]:
ser.ix[:1] # integer indexing

0    0.0
1    1.0
dtype: float64

In [258]:
ser3 = Series(range(3), index=[-5, 1, 3])

ser3

-5    0
 1    1
 3    2
dtype: int64

In [259]:
ser3.iloc[2] # integer indexing

2

In [260]:
frame = DataFrame(np.arange(6).reshape((3, 2)), index=[2, 0, 1])

frame

   0  1
2  0  1
0  2  3
1  4  5

In [261]:
frame.iloc[0] # integer indexing: first row (Series)

0    0
1    1
Name: 2, dtype: int64

### Panel Data

In [262]:
from pandas_datareader import data as web, wb

In [263]:
pdata = pd.Panel(dict(
        (stk, web.get_data_yahoo(stk, '1/1/2009', '6/1/2012'))
        for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 868 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2009-01-02 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: Open to Adj Close

In [264]:
pdata = pdata.swapaxes('items', 'minor')

In [265]:
pdata['Adj Close'].head()

                 AAPL      DELL        GOOG       MSFT
Date
2009-01-02  11.869133  10.39902  160.499779  16.612779
2009-01-05  12.370056  10.26359  163.861421  16.768039
2009-01-06  12.166024  10.68922  166.863420  16.964157
2009-01-07  11.903138  10.78596  160.844427  15.942712
2009-01-08  12.124172  10.90204  162.432840  16.441177

In [266]:
pdata.ix[:, '6/1/2012', :]

            Open        High         Low       Close       Volume   Adj Close
AAPL  569.159996  572.650009  560.520012  560.989983  130246900.0   73.371509
DELL   12.150000   12.300000   12.045000   12.070000   19397600.0   11.675920
GOOG  571.790972  572.650996  568.350996  570.981000    6138700.0  285.205295
MSFT   28.760000   28.959999   28.440001   28.450001   56634300.0   25.262972

In [267]:
pdata.ix['Adj Close', '5/22/2012':, :]

                 AAPL      DELL        GOOG       MSFT
Date
2012-05-22  72.845742  14.58765  300.100412  26.426222
2012-05-23  74.623162  12.08221  304.426106  25.849037
2012-05-24  73.937831  12.04351  301.528978  25.813517
2012-05-25  73.541536  12.05319  295.470050  25.804637
2012-05-28        NaN  12.05319         NaN        NaN
2012-05-29  74.846812  12.24666  296.873645  26.248626
2012-05-30  75.749262  12.14992  293.821674  26.053272
2012-05-31  75.560928  11.92743  290.140354  25.920075
2012-06-01  73.371509  11.67592  285.205295  25.262972

In [268]:
stacked = pdata.ix[:, '5/30/2012':, :].to_frame() # DataFrame

stacked

                        Open        High         Low       Close       Volume  \
Date       minor
2012-05-30 AAPL   569.199997  579.989990  566.559990  579.169998  132357400.0
           DELL    12.590000   12.700000   12.460000   12.560000   19787800.0
           GOOG   588.161028  591.901014  583.530999  588.230992    3827600.0
           MSFT    29.350000   29.480000   29.120001   29.340000   41585500.0
2012-05-31 AAPL   580.740021  581.499985  571.460022  577.730019  122918600.0
           DELL    12.530000   12.540000   12.330000   12.330000   19955600.0
           GOOG   588.720982  590.001032  579.001013  580.860990    5958800.0
           MSFT    29.299999   29.420000   28.940001   29.190001   39134000.0
2012-06-01 AAPL   569.159996  572.650009  560.520012  560.989983  130246900.0
           DELL    12.150000   12.300000   12.045000   12.070000   19397600.0
           GOOG   571.790972  572.650996  568.350996  570.981000    6138700.0
           MSFT    28.760000   28.959999   28.440001   28.450001   56634300.0

                   Adj Close
Date       minor
2012-05-30 AAPL    75.749262
           DELL    12.149920
           GOOG   293.821674
           MSFT    26.053272
2012-05-31 AAPL    75.560928
           DELL    11.927430
           GOOG   290.140354
           MSFT    25.920075
2012-06-01 AAPL    73.371509
           DELL    11.675920
           GOOG   285.205295
           MSFT    25.262972

In [269]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 3 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: AAPL to MSFT